import random

answers = ['Безперечно', 'Мені здається так', 'Поки неясно, спробуй знову', 'Навіть не думай',
           'Вирішено', 'Ймовірніше за все', 'Запитай пізніше', 'Моя відповідь ні',
           'Жодних сумнівів', 'Хороші перспективи', 'Краще не розповідати', 'За моїми даними - ні',
           'Безумовно так', 'Знаки кажуть - так', 'Зараз не можна передбачити', 'Перспективи не дуже добрі',
           'Можеш бути впевнений у цьому', 'Так', 'Сконцентруйся і спитай знову', 'Дуже сумнівно']

name = input('Привіт, я Магічна-куля, і я знаю відповідь на будь-яке твоє запитання! Як тебе звати?\n')
print(f"Привіт, {name}")

while True:
    question = input("Яке буде твоє запитання?\n")
    print("Моя відповідь: ", random.choice(answers))
    choice = int(input("Бажаєш ще щось запитати? (0: так, 1: ні)\n"))
    if choice == 0:
        continue
    else:
        print("Повертайся, якщо виникнуть запитання!")
        break